app/controllers/groups_controller.rb

SELECT  "xfiles".* FROM "xfiles" WHERE "xfiles"."id" = ? LIMIT 1  [["id", 2]]
---
  def new
    xfile_ids = params[:xfile_id]
    @file_names = []
    xfile_ids.each do |id|
      current_xfile = Xfile.find(id.to_i)

INSERT INTO "groups" ("prop", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["prop", "millis"], ["name", "{\"{:placeholder=>%22name of the group%22}\"=>\"test1\"}"], ["created_at", "2019-05-03 20:15:38.790450"], ["updated_at", "2019-05-03 20:15:38.790450"]]
SELECT  "xfiles".* FROM "xfiles" WHERE "xfiles"."id" = ? LIMIT 1  [["id", 2]]
---
  def create
    xfile_ids = params[:xfile_id]
    name = params[:group][:name]
    @group = Group.create!(:name => name)
    xfile_ids.each do |id|
      xfile = Xfile.find(id.to_i)

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    id = params[:id] # retrieve group ID from URI route
    @group = Group.find_by(:id => id)