app/controllers/xfiles_controller.rb

SELECT "groups".* FROM "groups" INNER JOIN "groups_xfiles" ON "groups"."id" = "groups_xfiles"."group_id" WHERE "groups_xfiles"."xfile_id" = ?  [["xfile_id", 1]]
---
  def edit
    @id = params[:id]
    @xfile = Xfile.find(@id)
    @prop = params[:prop]
    @groups = @xfile.groups