app/controllers/xfiles_controller.rb

  def show
    id = params[:id] # retrieve xfile ID from URI route
    @xfile = Xfile.find(id) # look up xfile by unique ID
    @content = eval(@xfile.content)
    @properties = Xfile.get_properties(@content)
    @groups = @xfile.groups
---
SELECT  "xfiles".* FROM "xfiles" WHERE "xfiles"."id" = ? LIMIT 1  [["id", 3]]
SELECT "groups".* FROM "groups" INNER JOIN "groups_xfiles" ON "groups"."id" = "groups_xfiles"."group_id" WHERE "groups_xfiles"."xfile_id" = ?  [["xfile_id", 1]]

  def index
    @xfiles = Xfile.all
    shared_props(Xfile.ids)
    if @xfiles.empty?
---
SELECT "xfiles"."id" FROM "xfiles"
SELECT COUNT(*) FROM "xfiles"

  def create
    @content = params[:content]
    if @content.nil?
      flash[:notice] = "Please attach a valid file"
      redirect_to new_xfile_path
    else
      params[:content].each do |file|
        @xfile = file.read
        @name = file.original_filename
        @extension = @name.split('.').last
        if @extension == "json"
          @data = Crack::JSON.parse(@xfile)
          @xfile = Xfile.create!(xfile_params) do |xfile|
---
INSERT INTO "xfiles" ("name", "content") VALUES (?, ?)  [["name", "student.json"], ["content", "{\"first\"=>\"riley\", \"last\"=>\"campbell\", \"SID\"=>\"1234\"}"]]

  def edit
    @id = params[:id]
    @xfile = Xfile.find(@id)
---
SELECT  "xfiles".* FROM "xfiles" WHERE "xfiles"."id" = ? LIMIT 1  [["id", 3]]

  def edit_post
    # id = params[:id] # retrieve movie ID from URI route
    # edit_file(Xfile.find(id), params[:property], params[:value])

    params[:group_id].each do |group_id|
      group = Group.find(group_id)
      group.xfiles.each do |xfile|
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
SELECT "xfiles".* FROM "xfiles" INNER JOIN "groups_xfiles" ON "xfiles"."id" = "groups_xfiles"."xfile_id" WHERE "groups_xfiles"."group_id" = ?  [["group_id", 1]]

  def shared_files
    @prop = params[:prop]
    @xfiles = Xfile.where("content like ?", "%\"#{@prop}\"%")
    @groups = Group.where("prop = ?", @prop.to_s)
---
SELECT "xfiles".* FROM "xfiles" WHERE (content like '%"first"%')
SELECT "groups".* FROM "groups" WHERE (prop = 'a')

  def shared_props(xfile_ids)
      prop_sets = Hash.new()
      @file_names = []
      xfile_ids.each do |id|
        current_xfile = Xfile.find(id.to_i)
---
SELECT  "xfiles".* FROM "xfiles" WHERE "xfiles"."id" = ? LIMIT 1  [["id", 16]]

  def download_xfile
    id = params[:id]
    @xfile = Xfile.find(id)
---
SELECT  "xfiles".* FROM "xfiles" WHERE "xfiles"."id" = ? LIMIT 1  [["id", 4]]

  def destroy
    @xfile = Xfile.find(params[:id])
    @xfile.destroy
---
SELECT  "xfiles".* FROM "xfiles" WHERE "xfiles"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "xfiles" WHERE "xfiles"."id" = ?  [["id", 2]]